aliyun/r10171_wr_20231215_08:37:00_sbtest_tableSize_1000000_tableCount_128_time_100_x1_threadCount_512_core_32_sbtest_run.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 512
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 512 tps: 11778.91 qps: 192207.85 (r/w/o: 120744.59/47410.20/24053.06) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 512 tps: 11750.10 qps: 187907.56 (r/w/o: 117472.98/46940.39/23494.20) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 512 tps: 12422.94 qps: 198629.01 (r/w/o: 124102.38/49680.75/24845.88) lat (ms,95%): 200.47 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 512 tps: 12478.08 qps: 200113.23 (r/w/o: 125116.77/50034.31/24962.15) lat (ms,95%): 200.47 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 512 tps: 12370.91 qps: 197683.51 (r/w/o: 123522.07/49418.63/24742.81) lat (ms,95%): 200.47 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 512 tps: 12404.11 qps: 198310.76 (r/w/o: 123925.10/49575.44/24810.22) lat (ms,95%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 512 tps: 12490.86 qps: 199715.70 (r/w/o: 124782.56/49951.42/24981.71) lat (ms,95%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 512 tps: 12571.16 qps: 201246.57 (r/w/o: 125815.61/50293.64/25137.32) lat (ms,95%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 512 tps: 15040.01 qps: 240889.20 (r/w/o: 150595.12/60206.05/30088.02) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 512 tps: 15772.00 qps: 252416.01 (r/w/o: 157686.01/63196.00/31534.00) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 512 tps: 15639.99 qps: 251051.86 (r/w/o: 157293.91/62464.97/31292.98) lat (ms,95%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 512 tps: 15350.02 qps: 244278.26 (r/w/o: 152100.16/61517.07/30661.03) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 512 tps: 15332.98 qps: 245535.65 (r/w/o: 153686.78/61151.91/30696.96) lat (ms,95%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 512 tps: 18695.69 qps: 299163.03 (r/w/o: 186972.89/74801.76/37388.38) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 512 tps: 21826.06 qps: 349287.90 (r/w/o: 218367.56/87272.22/43648.11) lat (ms,95%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 512 tps: 21926.75 qps: 350583.14 (r/w/o: 219045.62/87674.02/43863.50) lat (ms,95%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 512 tps: 21505.12 qps: 344353.93 (r/w/o: 215290.20/86054.48/43009.24) lat (ms,95%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 512 tps: 21113.66 qps: 337921.55 (r/w/o: 211187.60/84501.64/42232.32) lat (ms,95%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 512 tps: 23663.99 qps: 378456.86 (r/w/o: 236525.91/94617.96/47312.98) lat (ms,95%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 512 tps: 20775.51 qps: 332434.17 (r/w/o: 207781.11/83091.03/41562.03) lat (ms,95%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 512 tps: 26054.97 qps: 416784.47 (r/w/o: 260446.67/104241.87/52095.93) lat (ms,95%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 512 tps: 25644.00 qps: 410284.06 (r/w/o: 256442.04/102544.01/51298.01) lat (ms,95%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 512 tps: 25510.88 qps: 408343.91 (r/w/o: 255211.69/102117.46/51014.75) lat (ms,95%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 512 tps: 25141.88 qps: 402030.98 (r/w/o: 251314.75/100429.48/50286.75) lat (ms,95%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 512 tps: 24250.77 qps: 388273.40 (r/w/o: 242685.75/97081.10/48506.55) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 512 tps: 24269.89 qps: 388323.30 (r/w/o: 242668.93/97117.58/48536.79) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 512 tps: 24196.79 qps: 387014.62 (r/w/o: 241871.89/96745.16/48397.58) lat (ms,95%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 512 tps: 22688.21 qps: 363209.34 (r/w/o: 226961.09/90865.84/45382.42) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 512 tps: 23285.89 qps: 372529.26 (r/w/o: 232852.91/93113.57/46562.78) lat (ms,95%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 512 tps: 22621.16 qps: 361887.52 (r/w/o: 226202.57/90438.63/45246.31) lat (ms,95%): 58.92 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 512 tps: 22812.78 qps: 364652.69 (r/w/o: 227840.98/91203.15/45608.57) lat (ms,95%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 512 tps: 20712.39 qps: 332093.53 (r/w/o: 207746.17/82903.58/41443.79) lat (ms,95%): 90.78 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 512 tps: 20666.95 qps: 330145.49 (r/w/o: 206205.74/82620.84/41318.91) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 512 tps: 23331.21 qps: 373510.37 (r/w/o: 233510.11/93334.84/46665.42) lat (ms,95%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 512 tps: 23674.31 qps: 378699.89 (r/w/o: 236580.06/94761.22/47358.61) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 512 tps: 20456.78 qps: 327280.43 (r/w/o: 204624.81/81742.06/40913.56) lat (ms,95%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 512 tps: 23142.25 qps: 370454.93 (r/w/o: 231511.46/92674.98/46268.49) lat (ms,95%): 57.87 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 512 tps: 22619.80 qps: 361612.79 (r/w/o: 225953.00/90419.20/45240.60) lat (ms,95%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 512 tps: 21019.16 qps: 336806.58 (r/w/o: 210570.62/84179.65/42056.32) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 512 tps: 23849.97 qps: 381281.51 (r/w/o: 238289.69/95303.88/47687.94) lat (ms,95%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 512 tps: 21830.01 qps: 349461.15 (r/w/o: 218531.09/87265.04/43665.02) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 512 tps: 23128.37 qps: 369908.94 (r/w/o: 231113.76/92532.45/46262.73) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 512 tps: 22972.51 qps: 367784.30 (r/w/o: 229888.19/91957.08/45939.02) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 512 tps: 22577.21 qps: 360904.41 (r/w/o: 225558.13/90194.86/45151.41) lat (ms,95%): 63.32 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 512 tps: 22247.89 qps: 356211.40 (r/w/o: 222636.00/89067.61/44507.79) lat (ms,95%): 61.08 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 512 tps: 20141.02 qps: 322095.31 (r/w/o: 201260.18/80570.08/40265.04) lat (ms,95%): 108.68 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 512 tps: 19586.32 qps: 314330.20 (r/w/o: 196763.25/78375.30/39191.65) lat (ms,95%): 104.84 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 512 tps: 20009.64 qps: 319275.75 (r/w/o: 199235.90/80030.57/40009.29) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 512 tps: 18841.51 qps: 301350.12 (r/w/o: 188330.07/75342.03/37678.02) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 512 tps: 22146.03 qps: 354540.51 (r/w/o: 221656.32/88587.13/44297.06) lat (ms,95%): 71.83 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 512 tps: 20209.52 qps: 323251.39 (r/w/o: 201955.28/80882.06/40414.04) lat (ms,95%): 106.75 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 512 tps: 21199.61 qps: 339218.73 (r/w/o: 212037.08/84776.43/42405.22) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 512 tps: 21886.33 qps: 350309.28 (r/w/o: 218983.31/87546.31/43779.66) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 512 tps: 22731.88 qps: 363427.19 (r/w/o: 227090.89/90887.54/45448.77) lat (ms,95%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 512 tps: 20429.17 qps: 326755.73 (r/w/o: 204171.68/81725.70/40858.35) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 512 tps: 20743.15 qps: 332111.37 (r/w/o: 207688.48/82923.59/41499.30) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 512 tps: 21323.87 qps: 341339.87 (r/w/o: 213323.67/85370.47/42645.73) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 512 tps: 20748.20 qps: 331821.31 (r/w/o: 207329.10/83000.81/41491.41) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 512 tps: 21902.02 qps: 350318.39 (r/w/o: 218957.24/87556.10/43805.05) lat (ms,95%): 101.13 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 512 tps: 21169.63 qps: 338806.08 (r/w/o: 211757.30/84712.52/42336.26) lat (ms,95%): 82.96 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 512 tps: 23715.78 qps: 379396.46 (r/w/o: 237121.79/94842.12/47432.56) lat (ms,95%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 512 tps: 18678.42 qps: 298996.67 (r/w/o: 186862.17/74775.67/37358.83) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 512 tps: 23393.92 qps: 374224.77 (r/w/o: 233949.25/93485.67/46789.85) lat (ms,95%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 512 tps: 20491.19 qps: 327876.09 (r/w/o: 204878.94/82015.76/40981.39) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 512 tps: 22374.87 qps: 358120.98 (r/w/o: 223873.74/89497.49/44749.75) lat (ms,95%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 512 tps: 21413.74 qps: 342525.84 (r/w/o: 214038.40/85658.96/42828.48) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 512 tps: 20080.71 qps: 321190.36 (r/w/o: 200764.10/80272.83/40153.42) lat (ms,95%): 104.84 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 512 tps: 23096.58 qps: 369523.21 (r/w/o: 230905.77/92419.29/46198.15) lat (ms,95%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 512 tps: 18981.21 qps: 303737.34 (r/w/o: 189871.10/75889.82/37976.42) lat (ms,95%): 110.66 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 512 tps: 21433.50 qps: 342726.09 (r/w/o: 214138.08/85739.00/42849.01) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 512 tps: 20461.21 qps: 328101.58 (r/w/o: 205302.32/81861.84/40937.42) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 512 tps: 19622.27 qps: 313302.52 (r/w/o: 195584.88/78482.09/39235.55) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 512 tps: 22610.37 qps: 361704.00 (r/w/o: 226104.74/90385.50/45213.75) lat (ms,95%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 512 tps: 17238.46 qps: 275965.37 (r/w/o: 172478.61/69004.85/34481.92) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 512 tps: 22111.94 qps: 353562.99 (r/w/o: 220878.38/88473.74/44210.87) lat (ms,95%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 512 tps: 20139.87 qps: 323345.35 (r/w/o: 202203.02/80847.59/40294.74) lat (ms,95%): 84.47 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 512 tps: 19198.65 qps: 306400.73 (r/w/o: 191471.72/76529.71/38399.30) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 512 tps: 21595.63 qps: 345475.03 (r/w/o: 215931.27/86361.51/43182.25) lat (ms,95%): 104.84 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 512 tps: 19724.43 qps: 315925.08 (r/w/o: 197548.46/78917.74/39458.87) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 512 tps: 20746.57 qps: 331399.41 (r/w/o: 206991.93/82931.32/41476.16) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 512 tps: 23077.99 qps: 369276.80 (r/w/o: 230775.88/92331.95/46168.98) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 82s ] thds: 512 tps: 21426.88 qps: 343384.35 (r/w/o: 214756.02/85772.56/42855.77) lat (ms,95%): 99.33 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 512 tps: 18714.33 qps: 299059.45 (r/w/o: 186875.42/74757.37/37426.66) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 512 tps: 23515.96 qps: 376388.39 (r/w/o: 235279.63/94083.85/47024.92) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 512 tps: 23679.71 qps: 378826.38 (r/w/o: 236737.11/94735.84/47353.42) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 86s ] thds: 512 tps: 19686.58 qps: 315312.44 (r/w/o: 197144.93/78778.34/39389.17) lat (ms,95%): 116.80 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 512 tps: 20397.77 qps: 326102.45 (r/w/o: 203703.82/81602.09/40796.55) lat (ms,95%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 512 tps: 21989.63 qps: 351788.14 (r/w/o: 219866.34/87957.53/43964.27) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 512 tps: 20592.92 qps: 330867.39 (r/w/o: 207277.87/82392.67/41196.84) lat (ms,95%): 89.16 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 512 tps: 18917.69 qps: 301314.53 (r/w/o: 187799.41/75686.74/37828.38) lat (ms,95%): 189.93 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 512 tps: 23485.48 qps: 375543.50 (r/w/o: 234734.70/93830.85/46977.95) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 512 tps: 20092.12 qps: 321987.96 (r/w/o: 201320.22/80480.49/40187.24) lat (ms,95%): 108.68 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 512 tps: 20619.90 qps: 329665.39 (r/w/o: 206001.99/82421.60/41241.80) lat (ms,95%): 102.97 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 512 tps: 22482.19 qps: 359551.08 (r/w/o: 224681.94/89917.75/44951.38) lat (ms,95%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 512 tps: 20105.96 qps: 322077.53 (r/w/o: 201398.74/80449.86/40228.93) lat (ms,95%): 104.84 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 512 tps: 21688.88 qps: 346539.17 (r/w/o: 216452.90/86721.51/43364.76) lat (ms,95%): 104.84 err/s: 0.00 reconn/s: 0.00
[ 97s ] thds: 512 tps: 22679.74 qps: 363062.91 (r/w/o: 226963.47/90737.96/45361.48) lat (ms,95%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 98s ] thds: 512 tps: 18422.96 qps: 294952.36 (r/w/o: 184464.60/73637.84/36849.92) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 512 tps: 22780.80 qps: 364246.73 (r/w/o: 227485.96/91207.18/45553.59) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 512 tps: 22198.14 qps: 355017.32 (r/w/o: 221924.43/88695.61/44397.28) lat (ms,95%): 77.19 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            20608950
        write:                           8243580
        other:                           4121790
        total:                           32974320
    transactions:                        2060895 (20557.16 per sec.)
    queries:                             32974320 (328914.54 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.2505s
    total number of events:              2060895

Latency (ms):
         min:                                    4.25
         avg:                                   24.86
         max:                                 1099.92
         95th percentile:                      101.13
         sum:                             51223678.35

Threads fairness:
    events (avg/stddev):           4025.1855/3639.54
    execution time (avg/stddev):   100.0462/0.06